import random
import string

def random_address():
         index = ''.join([random.choice(string.digits) for x in range(6)])
         return f'{index} {random.choice(city)} {random.choice(street)} {random.randint(1,100)}'


city = ('м.Київ',
        'м.Вінниця',
        'м.Донецк',
        'м.Дніпро',
        'м.Житомир',
        'м.Запоріжжя',
        'м.Івано-Франковськ',
        'м.Краматорськ',
        'м.Кропивницький',
        'м.Луганськ',
        'м.Луцьк',
        'м.Львів',
        'м.Миколаїв',
        'м.Одеса',
        'м.Полтава',
        'м.Рівне',
        'м.Суми',
        'м.Тернопіль',
        'м.Ужгород',
        'м.Харків',
        'м.Хмельницький',
        'м.Черкаси',
        'м.Чернівці',
        'м.Чернігів',
        )

street = ('вул. Далека',
          'вул. Дачна',
          'вул. Дегтярна',
          'вул. Деревообробна',
          'вул. Джерельна',
          'вул. Автопаркова',
          'вул. Андріївська',
          'вул. Архітекторська',
          'вул. Астрономічна',
          'пров. Бабушкіна',
          'вул. Басейна',
          'вул. Березова',
          'вул. Бігова',
          'вул. Залужна',
          'вул. Залізна',
          'пров. Задорожний',
          'вул. Запорізька',
          'вул. Кабельна',
          'вул. Калинова',
          'вул. Канальна',
          'вул. Квітнева',
          'вул. Квітуча',
          'вул. Магістральна',
          'вул. Малинова',
          )



